benchmark/FieldExamples/poissonFlow/OF/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 0)
    (10 0 0)
    (10 1 0)
    (0 1 0)
    (0 0 0.1)
    (10 0 0.1)
    (10 1 0.1)
    (0 1 0.1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) allCells (200 20 1) simpleGrading (1 1 1)
);


boundary 
( 
inlet
{
 type inlet;
 faces
 (
   (0 4 7 3)
 );   
}

outlet
{
 type patch;
 faces
 (
   (1 5 6 2) 
 );   
}

top
{
 type wall;
 faces
 (
   (3 2 6 7)
 );   
}

bottom
{
 type wall;
 faces
 (
   (0 4 5 1) 
 );   
}

frontback
{
 type empty;
 faces
 (
   (4 7 6 5)
   (0 3 2 1) 
 );   
}
);

// ************************************************************************* //
